<?php
// Для реализации данной логики отображения списка новостей и детальной страницы новости необходимо настроить ЧПУ в
// настройках комплексного компонента news, а также настроить ссылки на список элементов и детальную страницу элемента в настройках инфоблока
// Все выше указанные настройки необходимо проводить с помощью встроенных элеасов битрикса, таких как #SECTION_CODE# и #ELEMENT_CODE#

// Ответ на дополнительный вопрос:
// /local/templates/<название шаблона сайта>/components/bitrix/news/bitrix/news.detail/.default/template.php